Картриджи/src/Documents/ПоступлениеКартриджей/ПоступлениеКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКартриджей</name>
  <registerRecords>InformationRegister.ПоступлениеКартриджей</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКартриджей</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсточник</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Картриджи</name>
    <attributes>
      <name>Картриджи</name>
      <type>
        <types>CatalogRef.МоделиКартриджей</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картриджи/src/Documents/ПоступлениеКартриджей/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КартриджиКартриджиПриИзменении(Элемент)
	
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Производитель = ПолучитьПроизводителя(Стр.Картриджи);
	Стр.Количество = 1;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроизводителя(Картридж)
	
	Возврат Картридж.Производитель;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Дата = НачалоДня(ТекущаяДата()) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = Справочники.Подразделения;
	Если Объект.Подразделение = Подразделение.ПустаяСсылка() тогда
		Объект.Подразделение = ПараметрыСеанса.ТекущийПользователь.ОсновноеПодразделение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Если Объект.Подразделение <> ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка") Тогда
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ИмяДокумента", "ПоступлениеКартриджей");
		
		Форма = ПолучитьФорму("ОбщаяФорма.ФормаПодбора", СтруктураПараметры, ЭтаФорма);
		Форма.Открыть();
		
	Иначе
		Сообщить("Выберите подразделение!");
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	//ПредварительнаяЗапись();
	ПроверкаНаОдинаковыеСтроки();
	
КонецПроцедуры

&НаСервере
Процедура ПредварительнаяЗапись()
	Объект.Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры // ПредварительнаяЗапись();()

&НаСервере
Процедура ПроверкаНаОдинаковыеСтроки()
	
	ТЗ_Картриджи = Объект.Картриджи.Выгрузить();
	
	ТЗ_Картриджи.Свернуть("Картриджи, Производитель", "Количество");
	
	Объект.Картриджи.Очистить();
	Объект.Картриджи.Загрузить(ТЗ_Картриджи);
	
КонецПроцедуры // ПРоВеркаНаОдинаковыесТРОКИ()

&НаКлиенте
Процедура ПриЗакрытии()
	ОбновитьИнтерфейс();
КонецПроцедуры
